In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [12]:
np.random.seed(100)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [15]:
df[df['W']> 0]

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

In [21]:
#index level
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [22]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [25]:
df = pd.DataFrame(randn(6,3),hier_index,['A','B','C'])

In [26]:
df

             A         B         C
G1 1  1.299748 -1.733096 -0.983310
   2  0.357508 -1.613579  1.470714
   3 -1.188018 -0.549746 -0.940046
G2 1 -0.827932  0.108863  0.507810
   2 -0.862227  1.249470 -0.079611
   3 -0.889731 -0.881798  0.018639

In [27]:
df.index.names = ['Groups','Num']

In [28]:
df

                   A         B         C
Groups Num
G1     1    1.299748 -1.733096 -0.983310
       2    0.357508 -1.613579  1.470714
       3   -1.188018 -0.549746 -0.940046
G2     1   -0.827932  0.108863  0.507810
       2   -0.862227  1.249470 -0.079611
       3   -0.889731 -0.881798  0.018639

In [34]:
df.loc['G1'].loc[2]['B']

-1.6135785028221759

In [35]:
df

                   A         B         C
Groups Num
G1     1    1.299748 -1.733096 -0.983310
       2    0.357508 -1.613579  1.470714
       3   -1.188018 -0.549746 -0.940046
G2     1   -0.827932  0.108863  0.507810
       2   -0.862227  1.249470 -0.079611
       3   -0.889731 -0.881798  0.018639

In [36]:
df.xs(3,level = 'Num')

               A         B         C
Groups
G1     -1.188018 -0.549746 -0.940046
G2     -0.889731 -0.881798  0.018639

In [38]:
# Missing Data

In [43]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [44]:
df = pd.DataFrame(d)

In [45]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [48]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [51]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [52]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [54]:
df.fillna(value='fun')

     A    B  C
0    1    5  1
1    2  fun  2
2  fun  fun  3

In [61]:
df['A'].fillna(value = df['C'].max())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [62]:
# Groupby

In [71]:
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
         'Person':['ritu','charchit','punit','pushpak','saswat','rajat'],
         'Sales':[220,120,340,432,215,550]}

In [72]:
data

{'Company': ['GOOGLE', 'GOOGLE', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['ritu', 'charchit', 'punit', 'pushpak', 'saswat', 'rajat'],
 'Sales': [220, 120, 340, 432, 215, 550]}

In [73]:
df = pd.DataFrame(data)

In [74]:
df

  Company    Person  Sales
0  GOOGLE      ritu    220
1  GOOGLE  charchit    120
2    MSFT     punit    340
3    MSFT   pushpak    432
4      FB    saswat    215
5      FB     rajat    550

In [75]:
comp = df.groupby('Company')

In [76]:
comp

In [77]:
comp.mean()

         Sales
Company
FB       382.5
GOOGLE   170.0
MSFT     386.0

In [82]:
df.groupby('Company').describe().transpose().transpose()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  382.5  236.880772  215.0  298.75  382.5  466.25  550.0
GOOGLE    2.0  170.0   70.710678  120.0  145.00  170.0  195.00  220.0
MSFT      2.0  386.0   65.053824  340.0  363.00  386.0  409.00  432.0

In [83]:
# Merging,joining and concatinating

In [86]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3']},
                  index = [0,1,2,3])

In [94]:
df2 = pd.DataFrame({'C':['A4','A5','A6','A7'],
                   'D':['B4','B5','B6','B7'],
                   'E':['C4','C5','C6','C7']},
                  index = [4,5,6,7])

In [95]:
df2

    C   D   E
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [96]:
pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B   C    D    E
0   A0   B0  C0  NaN  NaN
1   A1   B1  C1  NaN  NaN
2   A2   B2  C2  NaN  NaN
3   A3   B3  C3  NaN  NaN
4  NaN  NaN  A4   B4   C4
5  NaN  NaN  A5   B5   C5
6  NaN  NaN  A6   B6   C6
7  NaN  NaN  A7   B7   C7

In [97]:
 pd.concat([df1,df2],axis = 1)

     A    B    C    C    D    E
0   A0   B0   C0  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7

In [101]:
 pd.merge(df1,df2,how ='outer',on = 'C')

     A    B   C    D    E
0   A0   B0  C0  NaN  NaN
1   A1   B1  C1  NaN  NaN
2   A2   B2  C2  NaN  NaN
3   A3   B3  C3  NaN  NaN
4  NaN  NaN  A4   B4   C4
5  NaN  NaN  A5   B5   C5
6  NaN  NaN  A6   B6   C6
7  NaN  NaN  A7   B7   C7

In [102]:
# Operations:

In [103]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,333],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   333  xyz